OAT15_simulations/DDES_SALSA_validation_Re3e6_Ma0.73/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.4;

deltaT          5e-7;

writeControl    adjustable;

writeInterval   2e-3;

purgeWrite      0;

writeFormat     binary;

writePrecision   8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.95;

maxDeltaT       1e-6;

libs			("libSASALSACompressibleTurbulenceModel.so");

alpha           3.5;            // angle of attack
Uinlet          242.16629;      // free stream velocity
rho             0.957837;      // free stream density

functions
{
    pressure
    {
        type            pressure;
        libs            (fieldFunctionObjects);
        mode            totalCoeff;
        pInf            75230;
        rhoInf          $rho;

        Ux      #eval{$Uinlet * cos(degToRad($alpha))};
        Uz      #eval{$Uinlet * sin(degToRad($alpha))};

        UInf         ($Ux 0 $Uz);

        writeFields     false;
        executeControl  writeTime;
        executeInterval 1;
        writeControl    writeTime;
        writeInterval   1;
    }

    forces
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   1;
        log             false;

        patches
        (
            airfoil
        );

        // taken from: https://develop.openfoam.com/Development/openfoam/-/blob/OpenFOAM-v2412/tutorials/incompressible/pimpleFoam/LES/NACA4412/system/forceCoeffs
        liftDir         (
                            #eval{-sin(degToRad($alpha))} 
                            0 
                            #eval{cos(degToRad($alpha))}
                        );
        dragDir         (
                            #eval{cos(degToRad($alpha))} 
                            0 
                            #eval{sin(degToRad($alpha))}
                        );
        pitchAxis   (0 1 0);
        CofR        (0.25 0 0); // center of rotation at 25% chord
        rhoInf      $rho;
        magUInf     $Uinlet;
        lRef        1;
        Aref        0.25;   // projected area of the airfoil
    }

    Mach
    {
        type            MachNo;
        libs            (fieldFunctionObjects);
        field           U;
        log             true;
        executeControl  writeTime;
        executeInterval 1;
        writeControl    writeTime;
        writeInterval   1;
    }

    wallShearStress
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        patches         (airfoil);
        log             true;
        executeControl  writeTime;
        executeInterval 1;
        writeControl    writeTime;
        writeInterval   1;
    }

    surface
    {
        type            surfaces;
        libs            (sampling);
        timeStart       0.15;
        executeControl  writeTime;
        executeInterval 1;
        writeControl    writeTime;
        writeInterval   1;

        surfaceFormat   raw;
        fields          (total(p)_coeff yPlus p rho T wallShearStress);

        formatOptions
        {
            raw
            {
                normal true;
            }
        }

        surfaces
        {
            airfoil
            {
                type            patch;
                patches         (airfoil);
                interpolate     true;
                invariant       true;
                surfaceFormat   raw;
            }

            plane_xz
            {
                type    plane;
                source  cells;
                point   (0 -0.125 0);
                normal  (0 1 0);
            }
        }
    }

    Q
    {
        // Mandatory entries (unmodifiable)
        type            Q;
        libs            (fieldFunctionObjects);
        timeStart       0.15;
        executeControl  writeTime;
        executeInterval 1;
        writeControl    writeTime;
        writeInterval   1;
    }

    Lambda2
    {
        type            Lambda2;
        libs            (fieldFunctionObjects);

        timeStart       0.15;
        executeControl  writeTime;
        executeInterval 1;
        writeControl    writeTime;
        writeInterval   1;
    }

    yPlus
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        log             true;
        writeFields     false;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   1;
    }

    fieldAverage
        {
            type             fieldAverage;
            libs             (fieldFunctionObjects);
            executeControl   timeStep;
            executeInterval  1;
            writeControl     writeTime;
            writeInterval    1;
            timeStart        0.2;

            fields
            (
                U
                {
                    mean        on;
                    prime2Mean  on;
                    base        time;
                }

                p
                {
                    mean        on;
                    prime2Mean  on;
                    base        time;
                }
            );
        }

    Co
    {
        type            CourantNo;
        libs            (fieldFunctionObjects);
        executeControl  writeTime;
        executeInterval 1;
        writeControl    writeTime;
        writeInterval   1;
    }

    solverInfo
    {
        type            solverInfo;
        libs            ("libutilityFunctionObjects.so");
        fields          (U p T);
        writeResidualFields no;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   1;
    }
}

// ************************************************************************* //
