OAT15_simulations/DDES_SALSA_validation_Re3e6_Ma0.73/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync   false;

patches
(
    {
        // Name of new patch
        name Front;

        // Type of new patch
        patchInfo
        {
            type cyclic;
            neighbourPatch Back;
        }
    
        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (front);
    }
    {
        // Name of new patch
        name Back;

        // Type of new patch
        patchInfo
        {
            type cyclic;
            neighbourPatch Front;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (back);
    }
);


// ************************************************************************* //
