OAT15_simulations/DDES_SALSA_validation_Re3e6_Ma0.73/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom patch;

sourceCase ".";
sourcePatches (front);
exposedPatchName back;

flipNormals true;

extrudeModel        linearNormal;

nLayers         65;

linearNormalCoeffs
{
    thickness       0.25;
}

mergeFaces false;

// Merge small edges. Fraction of bounding box.
mergeTol 1e-8;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
