OAT15_simulations/DDES_SALSA_validation_Re3e6_Ma0.73/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap            false;
addLayers       false;

geometry
{
    wakeBox
    {
        type searchableCone;
        point1 (1.0035 -0.125 0.00045);
        point2 (1.00855 -0.125 0.00045);
        radius1         0.0022;
        innerRadius1    0;
        radius2         0.004;
        innerRadius2    0;
    }

    wakeBox2
    {
        type searchableCone;
        point1 (1.00855 -0.125 0.00045);
        point2 (10.0 -0.125 0.3);
        radius1         0.004;
        innerRadius1    0;
        radius2         2.1;
        innerRadius2    0;
    }

    SS
    {
        type searchableCone;
        point1 (1.0021 -0.125 0.00525);
        point2 (1.198 -0.125 0.205);
        radius1         0.0042;
        innerRadius1    0;
        radius2         0.185;
        innerRadius2    0;
    }

    // box directly over wakebox
    SS1
    {
        type searchableBox;
        min             (1.0033 -1 0.0031);
        max             (1.005 1 0.00505);
    }

    // box at the transition to the TE
    SS2
    {
        type searchableBox;
        min             (0.99901 -1 0.007);
        max             (1.00131 1 0.0093);
    }

    // box right next to SS2
    SS3
    {
        type searchableBox;
        min             (1.00037 -1 0.0065);
        max             (1.00131 1 0.008);
    }

    // box between wake box and SS
    SS4
    {
        type searchableBox;
        min             (1.0034 -1 0.0021);
        max             (1.005 1 0.0033);
    }
    
    // try to create circle for far field at SS
    SS5
    {
        type searchableCylinder;
        point1          (1.16 -1 0.14);
        point2          (1.16 1 0.14);
        radius         0.125;
    }
    // below SS5
    SS6
    {
        type searchableCylinder;
        point1          (1.224 -1 0.107);
        point2          (1.224 1 0.107);
        radius         0.098;
    }
    // below SS6
    SS7
    {
        type searchableCylinder;
        point1          (1.3 -1 0.09);
        point2          (1.3 1 0.09);
        radius         0.035;
    }

    // above (left) SS5
    SS8
    {
        type searchableCylinder;
        point1          (1.134 -1 0.204);
        point2          (1.134 1 0.204);
        radius         0.0935;
    }

    // above (left) SS8
    SS9
    {
        type searchableCylinder;
        point1          (1.12 -1 0.27);
        point2          (1.12 1 0.27);
        radius         0.042;
    }

    // above (left) SS9
    SS10
    {
        type searchableCylinder;
        point1          (1.091 -1 0.301);
        point2          (1.091 1 0.301);
        radius         0.0255;
    }
};

// Settings for the castellatedMesh generation.
castellatedMeshControls
{

    // Refinement parameters
    // ~~~~~~~~~~~~~~~~~~~~~

    maxLocalCells 100000;

    //maxGlobalCells 2000000;
    maxGlobalCells 10000000; //about 10GB memory

    minRefinementCells 0;

    maxLoadUnbalance 0.10;

    nCellsBetweenLevels 1;

    // Explicit feature edge refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    features
    (
    );

    // Surface based refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~

    refinementSurfaces
    {
    }

    // Feature angle:

    resolveFeatureAngle 30;

    //- Optional increment (on top of max level) in small gaps
    //It is added where the distance between two surface is less than 2 cells (refined)
    //gapLevelIncrement 2;

    planarAngle 80;

    // Region-wise refinement
    // ~~~~~~~~~~~~~~~~~~~~~~

    refinementRegions
    {
        wakeBox
        {
            mode inside;   
            levels ((1e15 1));
        }

	    wakeBox2
	    {
            mode inside;   
            levels ((1e15 1));
	    }

	    SS
	    {
            mode inside;   
            levels ((1e15 1));
	    }
    
	    SS1
	    {
            mode inside;   
            levels ((1e15 1));
	    }

	    SS2
	    {
            mode inside;   
            levels ((1e15 1));
	    }

	    SS3
	    {
            mode inside;   
            levels ((1e15 1));
	    }

	    SS4
	    {
            mode inside;   
            levels ((1e15 1));
	    }

	    SS5
	    {
            mode inside;   
            levels ((1e15 1));
	    }

	    SS6
	    {
            mode inside;   
            levels ((1e15 1));
	    }

	    SS7
	    {
            mode inside;   
            levels ((1e15 1));
	    }

	    SS8
	    {
            mode inside;   
            levels ((1e15 1));
	    }

	    SS9
	    {
            mode inside;   
            levels ((1e15 1));
	    }

	    SS10
	    {
            mode inside;   
            levels ((1e15 1));
	    }
    }

    // Mesh selection
    // ~~~~~~~~~~~~~~

    locationInMesh (1.25 -0.125 0);  

    allowFreeStandingZoneFaces true;

}

// Settings for the snapping.
snapControls
{
    // Number of patch smoothing iterations before finding correspondence
    // to surface
    nSmoothPatch 3;
    

    tolerance 1.0;

    nSolveIter 30;

    nRelaxIter 5;

    // Feature snapping

    nFeatureSnapIter 10;

    //For 2D
    implicitFeatureSnap true;

    explicitFeatureSnap false;

    multiRegionFeatureSnap false;
}

// Settings for the layer addition.
addLayersControls
{
    relativeSizes true;

    // Layer thickness specification. This can be specified in one of following
    // ways:
    // - expansionRatio and finalLayerThickness (cell nearest internal mesh)
    // - expansionRatio and firstLayerThickness (cell on surface)
    // - overall thickness and firstLayerThickness
    // - overall thickness and finalLayerThickness
    // - overall thickness and expansionRatio
    //
    // Note: the mode thus selected is global, i.e. one cannot override the
    //       mode on a per-patch basis (only the values can be overridden)

        // Expansion factor for layer mesh
        expansionRatio 1.0;

        // Wanted thickness of the layer furthest away from the wall.
        // If relativeSizes this is relative to undistorted size of cell
        // outside layer.

        // Wanted thickness of the layer next to the wall.
        // If relativeSizes this is relative to undistorted size of cell
        // outside layer.
        firstLayerThickness 6;

        // Wanted overall thickness of layers.
        // If relativeSizes this is relative to undistorted size of cell
        // outside layer.
        //thickness 0.5

    // Minimum overall thickness of total layers. If for any reason layer
    // cannot be above minThickness do not add layer.
    // If relativeSizes this is relative to undistorted size of cell
    // outside layer..
    minThickness 0.00001;

    // Per final patch (so not geometry!) the layer information
    // Note: This behaviour changed after 21x. Any non-mentioned patches
    //       now slide unless:
    //          - nSurfaceLayers is explicitly mentioned to be 0.
    //          - angle to nearest surface < slipFeatureAngle (see below)
    layers
    {
        domain
        {
            nSurfaceLayers 1;		  
        }
    }

    // If points get not extruded do nGrow layers of connected faces that are
    // also not grown. This helps convergence of the layer addition process
    // close to features.
    // Note: changed(corrected) w.r.t 17x! (didn't do anything in 17x)
    nGrow 0;

    // Advanced settings

    // Static analysis of starting mesh

        // When not to extrude surface. 0 is flat surface, 90 is when two faces
        // are perpendicular

        featureAngle 130;		//default


        // Stop layer growth on highly warped cells
        maxFaceThicknessRatio 0.5;

    // Patch displacement

        // Number of smoothing iterations of surface normals
        nSmoothSurfaceNormals 1;

        // Smooth layer thickness over surface patches
        nSmoothThickness 10;

    // Medial axis analysis

        // Reduce layer growth where ratio thickness to medial
        // distance is large
        maxThicknessToMedialRatio 0.3;

        // Number of smoothing iterations of interior mesh movement direction
        nSmoothNormals 3;

    // Mesh shrinking

        slipFeatureAngle 30;

        nRelaxIter 5;

        nBufferCellsNoExtrude 0;

        nLayerIter 50;

        nRelaxedIter 20;

}

// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    // Specify mesh quality constraints in separate dictionary so can
    // be reused (e.g. checkMesh -meshQuality)
    //#include "meshQualityDict"
    maxNonOrtho 75;
    minVol 1e-10;
    maxConcave 180;
    maxBoundarySkewness 2;
    maxInternalSkewness 2;

        minMedialAxisAngle 90;
        minMedianAxisAngle 90;
        minTetQuality -1e+30;
        minArea -1;
        minTwist 0.02;
        minDeterminant 0.000001;
        minFaceWeight 0.000005;
        minVolRatio 0.00001;
        minTriangleTwist -1;

    //minFlatness 0.5;

    // Advanced

        // Number of error distribution iterations
        nSmoothScale 4;
        // amount to scale back displacement at error points
        errorReduction 0.75;
}

// Advanced

//// Debug flags

//
//// Write flags

writeFlags
(
    scalarLevels    // write volScalarField with cellLevel for postprocessing
    layerSets       // write cellSets, faceSets of faces in layer
    layerFields     // write volScalarField for layer coverage
);

// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-6;

// ************************************************************************* //
