OAT15_simulations/DDES_SALSA_validation_Re3e6_Ma0.73/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pOut            75230;

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pOut;

boundaryField
{
    inlet_outlet
    {
        type            inletOutlet;
        inletValue      uniform $pOut;
        value           $inletValue;
    }

    airfoil
    {
        type            zeroGradient;
    }

    Front
    {
        type            cyclic;
    }

    Back
    {
        type            cyclic;
    }
}

// ************************************************************************* //
